package com.example.teddy.coreclass.player.styleenum;

import com.example.teddy.coreclass.player.IPlayerStyle;

/**
 * Created by teddy on 2017/10/6.
 * Donkey是用来形容那些打得超烂的玩家的，如果碰上这类玩家，技术好的牌手就该偷笑了，因为他们可以从这些“驴人”身上赚取大把票子。
 * Donkey在翻牌前会用很宽的范围跟注，在翻牌后会做很多烂的跟注，还会不顾及成败比的好坏而盲目追花。
 * 驴子（Donkeys）
 * 驴子是一个用来指水平很差玩家的一般术语，这种玩家进行毫无意义的行动。
 * 较低级别的驴子喜欢看翻牌圈且不知道你为什么在翻牌前加注，你不知道将发生什么。
 * 他喜欢诈唬并认为：“他什么也没有"并愿意用差牌跟注。
 * 他喜欢被动地玩听牌并在河牌圈没有成牌时诈唬对手。他下注和加注都没有理由。他在认为自己被打败时采用诈唬，他什么都没有时也跟注。
 * 他是一种给你送钱的玩家。 驴子趋向于太松和太被动。他们有牌时喜欢慢玩并愿意诈唬。
 * 他们急着想诈唬。他们的情绪也容易有很大的波动并从一个跟注站变成一个疯狂玩家的状态，这取决于他们是在赚钱还是在亏钱。留意这些情况。
 * 大部分驴子在游戏过程中多次改变他们的打法。
 * 驴子的确有一种才能:情绪失控。问题是他们不光是自己失控，他们完全不合理的打法还带着其他玩家情绪波动。
 * 驴子喜欢玩内听顺子，他们有时在河牌圈打中顺子。不是每个人都能处理好这种被反败为胜的情况。
 * 如果你在牌桌上碰到驴子，你就坚持标准的ABC打法。观察他的一举一动。
 * 他如何玩超强牌？他何时弃牌？不是所有的驴子都一样，但他们都很容易被发现并给你很多进攻的机会。
 * 一旦你看到这种类型的玩家，你可以逐渐地赚走他的钱。
 * 如果他运气很好，三次在河牌圈听到内听顺子，你要保持冷静并避免让自己失控。如果你感觉自己开始发脾气，那么你就去换一张新牌桌。
 */

public class Donkey implements IPlayerStyle {
}
