package com.example.teddy.coreclass.player.styleenum;

import com.example.teddy.coreclass.player.IPlayerStyle;

/**
 * Created by teddy on 2017/10/6.
 * 疯狂玩家（Maniacs）
 * 疯狂玩家是我们目前讨论过的完全相反的玩家类型。
 * 疯狂玩家是牌桌上的James Deans:疯狂且不能制服。
 * 区别是他们不像真的James Dean那么冷酷 - 他们更像一群劫匪。
 * 疯狂玩家玩得很松且十分激进。他不认为扑克是一种策略游戏，而是比谁的胆子最大。他肯定是胆子最大的玩家。
 * 你很容易引诱疯狂玩家进行诈唬。他们喜欢诈唬，你就让他们去这么干吧。慢玩在较低的级别没有太大作用，但你可以针对疯狂玩家做此例外。
 * 当你面对一个疯狂玩家时，你应该: 玩得紧些 引诱诈唬 自己不要诈唬
 * 等待好牌并像森林中天真的小女孩一样不怕大灰狼的进攻。不要让他把你拖入很多没有意义的对抗中。
 * 你朋友可能称你为大队长，但玩扑克是在合适的场合通过作出正确的决定来赚钱，而不是成为牌桌上的首领。你不能在对付疯狂玩家时把自己也变成他那样。
 * 就对手来说，你只是一个名称和图标。不管你多努力地想证明给对手看，你都不能向他证明什么。保持冷静并按照策略从他身上尽量赚更多的钱。
 * 像其它极端的玩家类型一样，疯狂玩家有能力让其他的玩家情绪失控。如果你不仅想赚对手的钱，并且还想留给对手持久的印象，那么你最好找一张正常对手的牌桌。
 * 你会发现这些牌桌更有利可图。
 */

public class Manlacs implements IPlayerStyle {
}
