package com.watchman1976.pigmokey.mimi20171012.coreclass.player.styleenum;


import com.watchman1976.pigmokey.mimi20171012.coreclass.player.IPlayerStyle;

/**
 * Created by teddy on 2017/10/6.
 * 跟注站打得很松很被动，他们玩牌过多并玩得太过；他们每注都跟，就算拿的是边缘牌也会用来跟注；
 * 他们无法判断自己何时是落后的，而拿到好牌时，他们也只会被动地行动，也就是说，他们在拿到好牌时很少下注建立底池或保护易受影响的牌。
 * 他们被称为跟注站，因为跟注是他们最喜欢的打法。他们几乎不会去诈唬别人。
 * 他们是一个没有自律性的群体，喜欢拿着听牌死磕，想要诈唬他们很难，可一旦我们拿了大牌，我们是很容易从他们手上赢大底池的。
 * 跟注站（Calling stations）
 * 跟注站在过去几年中已经逐渐消失。一些较老的玩家记得过去的好时光，牌桌上到处充斥着不知道弃牌的玩家。现在不是那么常见，但你仍然会不时地碰到他们。
 * 跟注站只知道: 跟注。他们长久地待在底池而很少表现出激进度，即使当他们有很好的牌时。
 * 他们甚至不需要跟注的理由。如果他们在翻牌前跟注你的加注，他们将在翻牌圈跟注你的下注，即使他们拿着一张6和一张9且牌面是38J的情况下。
 * 不要浪费时间来设法弄明白他们的疯狂。下面是你应该做的: 永远不要诈唬跟注站，也不要过分地半诈唬。 如果你有一手牌，那就下注。
 * 不要设法引诱诈唬，因为跟注站很少会诈唬。
 * 进行更松的价值下注。这意味着你可以用中等的成手牌下注，因为跟注站可能会找到一些理由而用更差的牌跟注。
 * 被动地玩听牌；跟注站将给你免费牌。 记住，如果一个跟注站表现激进，他可能有超强牌。
 * 当然也有例外的情况。当跟注站在河牌圈没有完成听牌时，他们有时会诈唬。虽然如此，他一般还是应该按照价值进行游戏。
 * 当你碰到不错的牌，设法尽量赚更多的钱。 只要你不让情绪失控，这是很简单的扑克游戏。当跟注站有段时间运气很好时，你容易控制不了情绪。
 * 这种情况是河牌出现唯一一张你不想看到的牌而让跟注站反败为胜。如果你知道这样会让你的神经受够折磨，那么你可能应该换一张牌桌。
 */

public class CallingStatioin implements IPlayerStyle {
}
